/*=================================================================================
 *	파 일 명		: IMS_$G.js
 *	작성목적		: 공통 $G 함수 - 템플릿 스크립 가비지 처리
 *	작 성 자		: 이상준
 *	최초작성일		: 2019.04.10
 *	최종작성일		:
 *	수정내역		:
 *	Description	: include 되는 스크립트 오브젝트를 null 처리				
 *				
 *					
=================================================================================*/

var $G = {
		
		gobject	:	[]

	//-------------------------------------------------------
	//	push	>	가비지 오브제트 수집
	//-------------------------------------------------------
	,	push	:
			function(o){
				this.gobject.push(o);
				
			}
	//-------------------------------------------------------
	//	removeall	>	가비지 오브제트 삭제
	//-------------------------------------------------------
	,	removeall	:
			function(){
				$U.each(this.gobject, function(o){
					o	=	null;
				});
			}
};	

